Конфигурация/src/InformationRegisters/РасписаниеЗанятий/РасписаниеЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеЗанятий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятия</name>
    <type>
      <types>CatalogRef.ВидыЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеньНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/InformationRegisters/ИсторияВызововAPI/ИсторияВызововAPI.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияВызововAPI</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>Успешно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОтвета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ВнешняяСистема</name>
    <type>
      <types>CatalogRef.ВнешниеСистемы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МетодAPI</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторВызова</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Enums/СтатусыОбращения/СтатусыОбращения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыОбращения</name>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнено</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
</mdclass:Enum>

Конфигурация/src/Documents/ОбращениеСтудента/ОбращениеСтудента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбращениеСтудента</name>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаОбращения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстОбращения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбращения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/Catalogs/Студенты/Студенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Студенты</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСтудента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗачетнойКнижки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСтудента</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Конфигурация/src/Catalogs/УчебныеГруппы/УчебныеГруппы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчебныеГруппы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГодПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеПодготовки</name>
    <type>
      <types>CatalogRef.НаправленияПодготовки</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормаОбучения</name>
    <type>
      <types>CatalogRef.ФормыОбучения</types>
    </type>
  </attributes>
</mdclass:Catalog>

Конфигурация/src/Catalogs/Преподаватели/Преподаватели.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Преподаватели</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПреподавателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УченаяСтепень</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работает</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Конфигурация/src/Catalogs/Дисциплины/Дисциплины.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Дисциплины</name>
  <attributes>
    <name>Кафедра</name>
    <type>
      <types>CatalogRef.Кафедры</types>
    </type>
  </attributes>
  <attributes>
    <name>КодДисциплины</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗачетныеЕдиницы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Активна</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Конфигурация/src/CommonModules/РаботаСWebAPISервер/Module.bsl
Функция ПолучитьСтудентов() Экспорт
	
	МассивСтудентов = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Студенты.Ссылка КАК Ссылка,
	|	Студенты.Код КАК Код,
	|	Студенты.Наименование КАК Наименование,
	|	Студенты.Фамилия КАК Фамилия,
	|	Студенты.ИмяСтудента КАК ИмяСтудента,
	|	Студенты.Отчество КАК Отчество,
	|	Студенты.УчебнаяГруппа КАК УчебнаяГруппа,
	|	Студенты.НомерЗачетнойКнижки КАК НомерЗачетнойКнижки,
	|	Студенты.Email КАК Email,
	|	Студенты.Статус КАК Статус
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	НЕ Студенты.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Студент = Новый Структура;
		Студент.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Студент.Вставить("code", Выборка.Код);
		Студент.Вставить("name", Выборка.Наименование);
		Студент.Вставить("last_name", Выборка.Фамилия);
		Студент.Вставить("first_name", Выборка.ИмяСтудента);
		Студент.Вставить("middle_name", Выборка.Отчество);
		Студент.Вставить("group", Строка(Выборка.УчебнаяГруппа));
		Студент.Вставить("record_book", Выборка.НомерЗачетнойКнижки);
		Студент.Вставить("email", Выборка.Email);
		Студент.Вставить("status", Строка(Выборка.Статус));
		
		МассивСтудентов.Добавить(Студент);
		
	КонецЦикла;
	
	Возврат МассивСтудентов;
	
КонецФункции

Функция ПолучитьУчебныеГруппы() Экспорт
	
	МассивГрупп = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчебныеГруппы.Ссылка КАК Ссылка,
	|	УчебныеГруппы.Код КАК Код,
	|	УчебныеГруппы.Наименование КАК Наименование,
	|	УчебныеГруппы.Курс КАК Курс,
	|	УчебныеГруппы.ГодПоступления КАК ГодПоступления,
	|	УчебныеГруппы.Активна КАК Активна
	|ИЗ
	|	Справочник.УчебныеГруппы КАК УчебныеГруппы
	|ГДЕ
	|	НЕ УчебныеГруппы.ЭтоГруппа
	|	И НЕ УчебныеГруппы.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Группа = Новый Структура;
		Группа.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Группа.Вставить("code", Выборка.Код);
		Группа.Вставить("name", Выборка.Наименование);
		Группа.Вставить("course", Выборка.Курс);
		Группа.Вставить("admission_year", Выборка.ГодПоступления);
		Группа.Вставить("active", Выборка.Активна);
		
		МассивГрупп.Добавить(Группа);
		
	КонецЦикла;
	
	Возврат МассивГрупп;
	
КонецФункции

Функция ПолучитьПреподавателей() Экспорт
	
	МассивПреподавателей = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Преподаватели.Ссылка КАК Ссылка,
	|	Преподаватели.Код КАК Код,
	|	Преподаватели.Наименование КАК Наименование,
	|	Преподаватели.Фамилия КАК Фамилия,
	|	Преподаватели.ИмяПреподавателя КАК ИмяПреподавателя,
	|	Преподаватели.Отчество КАК Отчество,
	|	Преподаватели.Кафедра КАК Кафедра,
	|	Преподаватели.Должность КАК Должность,
	|	Преподаватели.Email КАК Email,
	|	Преподаватели.Работает КАК Работает
	|ИЗ
	|	Справочник.Преподаватели КАК Преподаватели";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Преподаватель = Новый Структура;
		Преподаватель.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Преподаватель.Вставить("code", Выборка.Код);
		Преподаватель.Вставить("name", Выборка.Наименование);
		Преподаватель.Вставить("last_name", Выборка.Фамилия);
		Преподаватель.Вставить("first_name", Выборка.ИмяПреподавателя);
		Преподаватель.Вставить("middle_name", Выборка.Отчество);
		Преподаватель.Вставить("department", Строка(Выборка.Кафедра));
		Преподаватель.Вставить("position", Выборка.Должность);
		Преподаватель.Вставить("email", Выборка.Email);
		Преподаватель.Вставить("active", Выборка.Работает);
		
		МассивПреподавателей.Добавить(Преподаватель);
		
	КонецЦикла;
	
	Возврат МассивПреподавателей;
	
КонецФункции

Функция ПолучитьДисциплины() Экспорт
	
	МассивДисциплин = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Дисциплины.Ссылка КАК Ссылка,
	|	Дисциплины.Код КАК Код,
	|	Дисциплины.Наименование КАК Наименование,
	|	Дисциплины.КодДисциплины КАК КодДисциплины,
	|	Дисциплины.КоличествоЧасов КАК КоличествоЧасов,
	|	Дисциплины.ЗачетныеЕдиницы КАК ЗачетныеЕдиницы,
	|	Дисциплины.Активна КАК Активна
	|ИЗ
	|	Справочник.Дисциплины КАК Дисциплины";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Дисциплина = Новый Структура;
		Дисциплина.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		Дисциплина.Вставить("code", Выборка.Код);
		Дисциплина.Вставить("name", Выборка.Наименование);
		Дисциплина.Вставить("discipline_code", Выборка.КодДисциплины);
		Дисциплина.Вставить("hours", Выборка.КоличествоЧасов);
		Дисциплина.Вставить("credits", Выборка.ЗачетныеЕдиницы);
		Дисциплина.Вставить("active", Выборка.Активна);
		
		МассивДисциплин.Добавить(Дисциплина);
		
	КонецЦикла;
	
	Возврат МассивДисциплин;
	
КонецФункции

Функция ПолучитьРасписание() Экспорт
	
	МассивРасписания = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РасписаниеЗанятий.УчебнаяГруппа КАК УчебнаяГруппа,
	|	РасписаниеЗанятий.Дисциплина КАК Дисциплина,
	|	РасписаниеЗанятий.Преподаватель КАК Преподаватель,
	|	РасписаниеЗанятий.Аудитория КАК Аудитория,
	|	РасписаниеЗанятий.ВидЗанятия КАК ВидЗанятия,
	|	РасписаниеЗанятий.ДеньНедели КАК ДеньНедели,
	|	РасписаниеЗанятий.НомерПары КАК НомерПары,
	|	РасписаниеЗанятий.ВремяНачала КАК ВремяНачала,
	|	РасписаниеЗанятий.ВремяОкончания КАК ВремяОкончания,
	|	РасписаниеЗанятий.УчебныйПериод КАК УчебныйПериод
	|ИЗ
	|	РегистрСведений.РасписаниеЗанятий КАК РасписаниеЗанятий";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаРасписания = Новый Структура;
		СтрокаРасписания.Вставить("group", Строка(Выборка.УчебнаяГруппа));
		СтрокаРасписания.Вставить("discipline", Строка(Выборка.Дисциплина));
		СтрокаРасписания.Вставить("teacher", Строка(Выборка.Преподаватель));
		СтрокаРасписания.Вставить("classroom", Строка(Выборка.Аудитория));
		СтрокаРасписания.Вставить("lesson_type", Строка(Выборка.ВидЗанятия));
		СтрокаРасписания.Вставить("day_of_week", Выборка.ДеньНедели);
		СтрокаРасписания.Вставить("lesson_number", Выборка.НомерПары);
		СтрокаРасписания.Вставить("time_start", Формат(Выборка.ВремяНачала, "ДФ=HH:mm"));
		СтрокаРасписания.Вставить("time_end", Формат(Выборка.ВремяОкончания, "ДФ=HH:mm"));
		СтрокаРасписания.Вставить("academic_period", Строка(Выборка.УчебныйПериод));
		МассивРасписания.Добавить(СтрокаРасписания);
		
	КонецЦикла;
	
	Возврат МассивРасписания;
	
КонецФункции

Процедура ЗаписатьИсториюВызоваAPI(МетодAPI, Успешно, КодОтвета, ТекстОшибки, АдресЗапроса, ВнешняяСистема = Неопределено) Экспорт

	ЗаписьИстории = РегистрыСведений.ИсторияВызововAPI.СоздатьМенеджерЗаписи();

	ЗаписьИстории.Период = ТекущаяДата();
	ЗаписьИстории.ИдентификаторВызова = Строка(Новый УникальныйИдентификатор);

	Если ВнешняяСистема <> Неопределено И ЗначениеЗаполнено(ВнешняяСистема) Тогда
		ЗаписьИстории.ВнешняяСистема = ВнешняяСистема;
	КонецЕсли;

	ЗаписьИстории.МетодAPI = МетодAPI;
	ЗаписьИстории.Успешно = Успешно;
	ЗаписьИстории.КодОтвета = КодОтвета;
	ЗаписьИстории.ТекстОшибки = ТекстОшибки;
	ЗаписьИстории.АдресЗапроса = АдресЗапроса;

	ЗаписьИстории.Записать();

КонецПроцедуры

Функция СоздатьОбращениеСтудента(Данные, Студент) Экспорт

	СтудентОбъект = Студент.ПолучитьОбъект();

	Обращение = Документы.ОбращениеСтудента.СоздатьДокумент();
	Обращение.Дата = ТекущаяДата();
	Обращение.Студент = Студент;
	Обращение.УчебнаяГруппа = СтудентОбъект.УчебнаяГруппа;
	Обращение.ТемаОбращения = Строка(Данные.subject);
	Обращение.ТекстОбращения = Строка(Данные.text);
	Обращение.Статус = Перечисления.СтатусыОбращения.Новое;

	Обращение.Записать();

	Результат = Новый Структура;
	Результат.Вставить("id", Строка(Обращение.Ссылка.УникальныйИдентификатор()));
	Результат.Вставить("number", Обращение.Номер);
	Результат.Вставить("date", Обращение.Дата);
	Результат.Вставить("status", Строка(Обращение.Статус));

	Возврат Результат;

КонецФункции

Функция ПроверитьДанныеОбращения(Данные) Экспорт

	Если НЕ Данные.Свойство("student_id") Или ПустаяСтрока(Строка(Данные.student_id)) Тогда
		Возврат "Не указан student_id";
	КонецЕсли;

	Если НЕ Данные.Свойство("subject") Или ПустаяСтрока(Строка(Данные.subject)) Тогда
		Возврат "Не указана тема обращения";
	КонецЕсли;

	Если НЕ Данные.Свойство("text") Или ПустаяСтрока(Строка(Данные.text)) Тогда
		Возврат "Не указан текст обращения";
	КонецЕсли;

	Возврат "";

КонецФункции

Функция ПроверитьСтудентаПоИдентификатору(StudentID) Экспорт

	Попытка
		ИдентификаторСтудента = Новый УникальныйИдентификатор(Строка(StudentID));
	Исключение
		Возврат Новый Структура("Успешно,Код,Сообщение,Студент", Ложь, 400, "Некорректный student_id", Неопределено);
	КонецПопытки;

	СсылкаСтудента = Справочники.Студенты.ПолучитьСсылку(ИдентификаторСтудента);

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Студенты.Ссылка КАК Студент
	|ИЗ
	|	Справочник.Студенты КАК Студенты
	|ГДЕ
	|	Студенты.Ссылка = &Студент
	|	И НЕ Студенты.ПометкаУдаления";

	Запрос.УстановитьПараметр("Студент", СсылкаСтудента);

	Выборка = Запрос.Выполнить().Выбрать();

	Если НЕ Выборка.Следующий() Тогда
		Возврат Новый Структура("Успешно,Код,Сообщение,Студент", Ложь, 404, "Студент не найден", Неопределено);
	КонецЕсли;

	Возврат Новый Структура("Успешно,Код,Сообщение,Студент", Истина, 200, "", Выборка.Студент);

КонецФункции
